package xyz.fcr.sberbank_hw1

//Массивы для преобразования рус -> англ
val russianFrom = arrayOf(
    "А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р",
    "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я",
    "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р",
    "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", " "
)

val russianTo = arrayOf(
    "A", "B", "V", "G", "D", "E", "E", "Zh", "Z", "I", "I", "K", "L", "M", "N", "O", "P", "R", "S",
    "T", "U", "F", "Kh", "Ts", "Ch", "Sh", "Shch", "Ie", "Y", "", "E", "Yu", "Ya",
    "a", "b", "v", "g", "d", "e", "yo", "zh", "z", "i", "y", "k", "l", "m", "n", "o", "p", "r", "s",
    "t", "u", "f", "kh", "ts", "ch", "sh", "shch", "ie", "y", "", "e", "yu", "ia", " "
)

//Массивы для преобразования англ -> рус
val latinFrom = arrayOf(
    "Yo", "Zh", "Kh", "Ts", "Ch", "Sh", "Shch", "Yu", "Ya", "Ie", "A", "B", "C", "D", "E", "F", "G", "H", "I",
    "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
    "yo", "zh", "kh", "ts", "ch", "sh", "shch", "yu", "ya", "ie", "a", "b", "c", "d", "e", "f", "g", "h",
    "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", " "
)

val latinTo = arrayOf(
    "Ё", "Ж", "Х", "Ц", "Ч", "Ш", "Щ", "Ю", "Я", "Ъ", "А", "Б", "С", "Д", "Е", "Ф", "Г", "Х", "И",
    "Дж", "К", "Л", "М", "Н", "О", "П", "К", "Р", "С", "Т", "У", "В", "В", "Кс", "И", "З",
    "ё", "ж", "х", "ц", "ч", "ш", "щ", "ю", "я", "ъ", "а", "б", "с", "д", "е", "ф", "г", "х", "и",
    "дж", "к", "л", "м", "н", "о", "п", "к", "р", "с", "т", "у", "в", "в", "кс", "и", "з", " "
)